[
    {
        "full_name": "Michael Heffelfinger",
        "role": "Senior Director of Services | Leader | Mentor | Software Enthusiast",
        "review_date": "June 30, 2021",
        "relationship": "Michael was senior to Robert but didn't manage directly",
        "comment": "Rob was instrumental in helping us integrate two of our largest UK acquisitions and further help us mature our services operational process for our CXM business unit. Doing all of this with an incredible amount of energy, professionalism, and fortitude. I look forward to the day our path cross and would welcome him to be part of my team."
    },
    {
        "full_name": "Saima Nazir",
        "role": "Solutions Consultant at RainFocus",
        "review_date": "June 12, 2021",
        "relationship": "Robert worked with Saima in the same group",
        "comment": "I have never met someone so keen to help his colleagues grow. Rob has extensive technical knowledge and is always sharing this with the team. Every time I've needed his assistance, not only does he provide me with a solution but makes sure I'm confident with what he's explained. From the very first week he started, he quickly understood the challenges in the team & limitations within the tooling available and took it upon himself to create processes and scripts to make it easier for us. Whether there's a technical query, or a process query, Rob has always been the 'go to' man. He's brilliant - truly brilliant."
    },
    {
        "full_name": "Steve Denner",
        "role": "Consultant / SaaS / MarTech / Business Growth",
        "review_date": "October 20, 2020",
        "relationship": "Steve was senior to Robert but didn't manage directly",
        "comment": "Rob's not only a lovely chap to work alongside, but one of the most diligent and hard working people I've ever encountered. He runs through brick walls to provide the best he can for his clients and is a patient and thorough teacher. Oh and he's also pretty smart too, as he very much knows his stuff, gathering a wide range of technical skills throughout our time working together."
    },
    {
        "full_name": "Hardeep Johal",
        "role": "Head of Product at Orlo",
        "review_date": "October 16, 2020",
        "relationship": "Hardeep worked with Robert in different groups",
        "comment": "Simply put, Rob is dependable. Whatever you need, whenever you need it, he is always there to help and you can guarantee the quality of work and thinking is second to none. I was lucky enough to work with Rob over many years and on numerous projects and knowing he was part of the team was a huge relief because you knew with him being involved it was going to be a success. He has a rare ability to mix his technical aptitude with point perfect planning skills and a common sense approach to everything. As you can probably tell, I cant speak highly enough of him. I honestly hope I get the chance with Rob again in the future."
    },
    {
        "full_name": "Alicia Retzlaff",
        "role": "Director, Customer Experience & Compliance at Very Good Security",
        "review_date": "March 3, 2020",
        "relationship": "Robert worked with Alicia in the same group",
        "comment": "It's been a pleasure working with Rob. He approaches opportunities with a positive, pragmatic mind - mixed with a healthy dose of wit as needed. Rob cares about delivering strong solutions that create success for his team and his employer. He's quick to learn new areas of knowledge and conducts business with integrity. His technical acumen combined with his ability to lead a team contribute to him being a true asset anywhere."
    },
    {
        "full_name": "Carl Chambers",
        "role": "Email Marketing Geek | MarTech Consultant | Growth Expert | Technologist",
        "review_date": "March 13, 2019",
        "relationship": "Robert worked with Carl in the same group",
        "comment": "I had the pleasure of working with Rob for many years and seeing his career develop over his time at Adestra. Rob is a true team player and will always go out of his way to help those around him. He has a unique blend of leadership capability in combination with deep technical understanding and the ability to deliver fantastic client facing customer service. He's an absolutely star and I would love to work with Rob again in the future."
    },
    {
        "full_name": "Lisa Snuggs",
        "role": "Teaching Assistant at Ladygrove Park Primary School",
        "review_date": "February 3, 2019",
        "relationship": "Lisa worked with Robert in different groups",
        "comment": "I had the great pleasure of working with Rob at Adestra for around 3 years. You could not fail to be impressed by Rob's technical and product knowledge but for me, it was his ability to translate this knowledge into context for his wide variety of stakeholders. He did this by listening and really understanding his stakeholders needs. I also admired the strong relationships Rob had with his direct reports and others across the business. That's why, when it came to my maternity leave, I was super lucky to have Rob lead my team (Product Management). Rob did an amazing job juggling my maternity cover alongside his current role. He was a great support to the team day-to-day and in their transition to agile development. He keep me well-updated during my leave and we had smooth handovers either side; all contributing to a successful return-to-work for me (which I can't thank Rob enough for) and a great opportunity for Rob to experience Product Management and grow his awesome skill set further!"
    },
    {
        "full_name": "Karen Leibowitz, PMP",
        "role": "Implementation Consultant at Ragnarok",
        "review_date": "February 1, 2019",
        "relationship": "Karen worked with Robert in different groups",
        "comment": "Rob's leadership in product teams, and mastery in software development have been essential to the company's growth. His ability to share knowledge of complex processes is why he was also able to be involved in various departmental teams like my own."
    },
    {
        "full_name": "David Stevenson",
        "role": "Software Architect at Adestra",
        "review_date": "February 1, 2019",
        "relationship": "Robert worked with David in the same group",
        "comment": "I worked with Rob for many years at Adestra and he was a great team member, highly valued by us. It was a blow to the company when he moved on. He is always keen to learn about the technical (programming, databases, etc) aspects of the job, and also about team leadership. One thing I particularly admire is how cool he keeps when, say, system issues were making things difficult. I'd be very happy if we worked together again in the future."
    },
    {
        "full_name": "Ian Berry",
        "role": "Programme Manager at The Access Group",
        "review_date": "January 31, 2019",
        "relationship": "Robert worked with Ian in the same group",
        "comment": "Within days of starting at Rant & Rave, Rob had established himself as an integral member of the team. He has now worked with me on numerous customer projects and change requests, each time getting great feedback from our clients. His technical knowledge is outstanding. A wholly dependable and professional person to work with."
    },
    {
        "full_name": "Claire Braunstein Barnes",
        "role": "Content Writer and Strategist",
        "review_date": "October 1, 2018",
        "relationship": "Claire worked with Robert in different groups",
        "comment": "I had the pleasure of working with Rob at Adestra for over a year, and was consistently impressed by his industry expertise and ability to offer a friendly helping hand even while juggling countless other projects of his own. Personable, knowledgeable, and dedicated - I hope to work with Rob again one day :)"
    },
    {
        "full_name": "Ali Keys",
        "role": "Agile Project Manager at Adestra",
        "review_date": "September 30, 2018",
        "relationship": "Robert worked with Ali in the same group",
        "comment": "I've worked with Rob for the last 2 years, both as a colleague and also with him as my Line Manager. I can't commend Rob highly enough – as a Manager he's approachable, friendly, empathetic, is a great example to his direct reports and follows through on any promises he makes. I worked with him on several projects, where his knowledge and understanding of the systems we use and our platform, paid absolute dividends. If clients ever needed reassurance around how the platform would work for them, the Account Managers would wheel Rob out not just because of the level of knowledge he has, but also because of his wonderful communication style with our clients. Rob was definitely one of the “go to” guys in the company, and for that reason he won the Employee of the Year Awards on several occasions. He helped numerous people out, always without complaint, for which he was recognised with these Awards. Rob's a massive asset to any company, he'll be sorely missed by all in Adestra."
    },
    {
        "full_name": "Denise Godfrey",
        "role": "System Engineer IV at Elsevier",
        "review_date": "September 26, 2018",
        "relationship": "Denise reported directly to Robert",
        "comment": "I worked with Rob for around 2 and a half years at Adestra and throughout that time Rob has been my inspiration. His dedication to his work and the huge amount of effort he makes to help others is what really pushed me to follow a similar career path. When I joined Adestra, I had no knowledge of databases or programming and no real interest in changing this. However, as I got more into the Support role and worked more alongside Rob and his team, my interest for this career grew and grew. Rob identified this from the beginning and made the effort (even though it wasn't part of his job role) to come and sit with me and go through any cases I had raised in further detail. By doing this, he really helped me develop my knowledge which in turn helped progress throughout the different departments. As a result of this, I have now become the technical solutions team leader. Rob is very knowledgable and is really good at transferring that knowledge on to others. In my time working with Rob, I never once saw him stress or complain at his work load or at the fact of helping others and this showed as he was a true source of motivation throughout the different departments and everyone in the business respects him. He never let the pressure of any of the work get to him or to any of his team and was always going above and beyond to sort out any queries that came his way, even if it meant he had to stay late or juggle a few things around. He was the one true guru at Adestra! As a manager, Rob is very approachable and I never had any problems raising any issues or concerns I had with him. I was happy to speak to him about anything and I felt as though he truly had my back in any issues we faced. Likewise, if I ever made any mistakes, I was never afraid of letting him know and I knew he would be there right away to help me resolve them. In short, Rob is a approachable, experienced manager who is always happy to get involved in the nitty gritty. Not only this, Rob is a fantastic, kind hearted person to be around who will always try to cheer you up when you are down. It has been a pleasure to work alongside him and he is definitely on his way to greater things!"
    },
    {
        "full_name": "Bradley Margerrison",
        "role": "Application Developer at Captec Systems",
        "review_date": "July 21, 2018",
        "relationship": "Bradley reported directly to Robert",
        "comment": "Throughout my time at Adestra, I have been lucky enough to work with Rob, the last 2 years being under his management. From the beginning, I was impressed with his technical knowledge & abilities accompanied by his friendly, helpful character. Rob's influence has been instrumental to the development of my career thus far, as he has closely mentored and coached me - the advice he has given over the years has been invaluable. I have collabarated with Rob not only on a vast array of internal and client projects, but also when aiding the Systems team in resolving any operational issues. I've never known a person who is as focused in pressured situations. Working with Rob, I always feel confident that we can deliver some creative and effective solutions. He demonstrates willingness to support his colleagues without fail, contributes & adapts to any change in the workplace with positivity and functions beyond expectation. As a manager, our department has controlled unexpectedly high volumes in workload. Rob has guided myself & other colleagues where lost and is there to talk to about any issues, not only work-related but also general well-being. Whilst sometimes it can be challenging to dissolve quandary, I've seen active improvements following his involvement. On a personal level, he is amiable and kind. He brings cheer and laughter to the office (as well as food treats for the team!). I could not be more thankful for a trustworthy colleague and one of the best managers I've had."
    },
    {
        "full_name": "Jonathan Hall",
        "role": "Engineering Lead at Sage",
        "review_date": "December 15, 2016",
        "relationship": "Robert worked with Jonathan in the same group",
        "comment": "It's rare you come across someone like Robert. Robert is a broad-minded, honest, careful and efficient team player. I have worked with him for many years and it has been a real pleasure. His ability to analyse data, problem solve and his team management skills is a great benefit to the business. He is ready to deal with difficult situations and solve the problems on time."
    },
    {
        "full_name": "Matt Gray",
        "role": "Customer Experience & Loyalty Champion | Mastercard | SessionM",
        "review_date": "June 17, 2015",
        "relationship": "Matt worked with Robert in different groups",
        "comment": "I had the pleasure of working with Rob during my 2-year tenure at Adestra as an Account Manager. Rob used his vast knowledge and experience as a skilled developer to assist with the development of bespoke client projects, including complex integration into other systems and software. He also worked tirelessly in providing a level of technical support to escalated queries that needed the input of a developer to aid in resolutions. Rob has always had a clear vision and a methodical approach to his work - often questioning the scope of proposed projects to identify improvements and opportunities for new technologies and processes to be implemented that will benefit the client. Rob has continued to push himself in learning new languages and technologies to develop his skills, ensuring he is at the forefront of software and technology development. I would describe him as an trustworthy, intelligent, dedicated and enthusiastic in all he does. Rob has always been able to bond quickly with colleagues, knowing what motivates them and developing quick working relationships that really allow for complex projects to come to fruition in a timely manner - ultimately making the lives of those around him easier. He will be a valued asset to any company lucky enough to employ his services."
    },
    {
        "full_name": "Dan Hewitt",
        "role": "Customer Success Manager at Redsquid",
        "review_date": "March 23, 2015",
        "relationship": "Dan worked with Robert in different groups",
        "comment": "Through my seven years of working alongside Rob, I have always found him to be a detail-oriented, communicative problem solver who is willing to tackle any and all challenges that are presented to him and never says no to someone who needs his help. Winner of many company awards at Adestra, I was fortunate to work closer with Rob in one of my roles within the company and more fully experienced and appreciated his vast knowledge in SQL, Perl and Console-based environments and owe my own skill in these areas to him entirely. When Rob is unavailable, you can certainly notice it within the company - his pools of experience, knowledge and friendly attitude really are a credit to him and any who have the fortune to work alongside him."
    },
    {
        "full_name": "Catherine Prior-Holt",
        "role": "Forest School Leader",
        "review_date": "February 12, 2013",
        "relationship": "Catherine worked with Robert in different groups",
        "comment": "Robert has always offered a high level of support to the Account Management team on any technical projects or queries. He is efficient, fast with his responses and always happy to go the extra mile, and to explain complicated projects to those not quite as technical. Great to work with."
    },
    {
        "full_name": "Tim Little",
        "role": "Systems Development Engineer at Amazon Web Services (AWS)",
        "review_date": "December 20, 2012",
        "relationship": "Robert worked with Tim in the same group",
        "comment": "I have worked with Rob for a over year and a half in the Development team at Adestra and i have found his approach and manner very profession. His approach to a problem is very methodical and he makes sure all processes are followed to avoid errors and disruption. He is always happy to help and share his knowledge with others."
    },
    {
        "full_name": "Jim Ellis",
        "role": "Salesforce Administrator at Phrasee®",
        "review_date": "August 12, 2010",
        "relationship": "Jim managed Robert directly",
        "comment": "I have worked with Rob for 4 years, and managed him directly for 18 months. In that time I have seen Rob develop into a very capable and diligent colleague within Adestra. He is very willing to assist with whatever problem or issue that a client needs help with - often providing a solution that goes above and beyond what the client has expected. He is reliable, witty and willing to pass on his expertise to whoever requires the necessary knowledge to enhance how they perform in their role. All round a pleasure to know, as well as to work with."
    },
    {
        "full_name": "Sean Hayes",
        "role": "Group Head of Data Insight at Infopro Digital",
        "review_date": "July 8, 2010",
        "relationship": "Sean was a client of Robert's",
        "comment": "We as a company are very demanding of Robert's time but he always adopts a 'can-do' attitude. His work always meets our requirements and he has a good understand of how our business works. He is efficient and always works in a professional manor."
    },
    {
        "full_name": "Simon Bannister",
        "role": "Head of Email Marketing at GTI Media",
        "review_date": "July 7, 2010",
        "relationship": "Simon was senior to Robert but didn't manage directly",
        "comment": "Rob's excellent grasp of technology and desire to help everybody makes him one of the most valuable people I have ever worked with. He always goes that extra mile to make sure he meets and exceeds the expectations of his colleagues and his clients."
    },
    {
        "full_name": "Reena Mistry",
        "role": "Head of Go To Market SAS UK&I at SAS",
        "review_date": "April 29, 2010",
        "relationship": "Reena was senior to Robert but didn't manage directly",
        "comment": "I have worked with Rob at Adestra for 2 years and previously as a client of Adestra and it has been a pleasure. Rob is a diligent, very capable guy who you can trust to get the job done. There have been many projects I have worked with him on where he has gone above and beyond to ensure the client recieves what they need on time. He's always keen to learn and his technical skills have grown and continue to grow day-by-day since I have known him. He's also a great person to work with, good fun and a well-balanced chap."
    },
    {
        "full_name": "Jamie Marr",
        "role": "Technical Solutions Consultant at Adestra",
        "review_date": "April 28, 2010",
        "relationship": "Jamie worked with Robert in different groups",
        "comment": "I have worked with Robert for 3 years and over that time Rob has always been a integral member of the development team. He has a in depth technical knowledge and a wide skill set. In addition to this he is always willing to assist with any problem while efficiently managing his own workload."
    }
]